{
  "about" : {
    "para1" : "As a passionate and dedicated web developer, I thrive on learning, creating, and solving real-world problems through technology. My journey in programming began during high school, and over the years, it has transformed from a hobby into a deep-rooted passion and career pursuit.",
    "para2" : "With a strong command of HTML, CSS, JavaScript, TypeScript and backend technologies like Node.js and MongoDB, I specialize in building dynamic, responsive, and user-centric web applications. My expertise extends to modern frameworks such as React and Bootstrap, enabling me to craft visually appealing and seamless user experiences",
    "para3" : "What sets me apart is my creative mindset and collaborative approach. Whether it's working within a team or directly with clients, I prioritize understanding goals and translating visions into functional and innovative solutions. I value clear communication and ensure that every project reflects excellence and attention to detail.",
    "para4" : "As I advance my journey in web development, I actively seek opportunities to apply my skills in impactful ways. Be it through internships, freelance projects, or collaborative endeavors, I am eager to contribute to organizations that champion innovation, teamwork, and a forward-thinking mindset."
  },
  "education" : [
    {
      "level" : "Undergraduation",
      "id" : "ug",
      "degree" : "Bachelor of Computer Application (BCA)",
      "deg-place" : "from Ambedkar Institute of Technology",
      "year" : "2020 - 2023",
      "learnings" : [
        "Developed strong research and critical analysis skills",
        "Collaborated effectively in team-based projects and assignments"
      ]
    },
    {
      "level" : "Senior Secondary",
      "id" : "sc",
      "degree" : "Senior Secondary Education",
      "deg-place" : "from CBSE (Central Board of Secondary Education)",
      "year" : "2018 - 2020",
      "learnings" : [
        "Prepared for higher education or entry into the professional workforce",
        "Demonstrated proficiency in problem-solving and decision-making"
      ]
    },
    {
      "level" : "Secondary",
      "id" : "sec",
      "degree" : "Secondary Education",
      "deg-place" : "from CBSE (Central Board of Secondary Education)",
      "year" : "2016 - 2018",
      "learnings" : [
        "Developed foundational knowledge in various subjects",
        "Participated in extracurricular activities for holistic development"
      ]
    }
  ],
  "workExperience": [
    {
      "id": "we1",
      "position": "Full Stack Intern",
      "company": "Milestone Global Moneymart Pvt. Ltd.",
      "duration": "Dec 2023 - Dec 2023",
      "responsibilities": [
        "Role-Based Access Control.",
        "Routing in React, Public and Protected routes.",
        "Proficiently integrated Facebook's, Twitter's, and LinkedIn's developer APIs to enable automated image posting functionality within the app."
      ]
    },
    {
      "id": "we2",
      "position": "Full Stack Developer",
      "company": "Milestone Global Moneymart Pvt. Ltd.",
      "duration": "Jan 2024 - Present",
      "responsibilities": [
        "Improved application performance by optimizing database queries and implementing caching strategies, resulting in a 30% reduction in load times.",
        "Created and deployed applications on cloud platforms like Heroku and Azure.",
        "Implemented authentication and authorization mechanisms using JWT, login with Zoho and login with Google to secure user data and enhance application security.",
        "State Management with Redux, Custom hooks, and Debouncing."
      ]
    }
  ]
}